Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile
The IFC2X3_ParametricObject_CShapeProfile class contains the C-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile.Depth
The depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile.Width
The width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile.WallThickness
The wall thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile.Girth
The girth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile.InternalFilletRadius
The internal fillet radius.